Dlubal.RFEM5.DesignSituationType
Type of design situation.

Dlubal.RFEM5.DesignSituationType.UnknownDesignSituation
Unknown type

Dlubal.RFEM5.DesignSituationType.NoneDesignSituation
None

Dlubal.RFEM5.DesignSituationType.OtherDesignSituation
Other

Dlubal.RFEM5.DesignSituationType.ManualUls
Manual ULS

Dlubal.RFEM5.DesignSituationType.ManualUlsAccidental
Manual ULS Accidental

Dlubal.RFEM5.DesignSituationType.ManualSeismic
Manual Seismic

Dlubal.RFEM5.DesignSituationType.ManualFire
Manual Fire

Dlubal.RFEM5.DesignSituationType.ManualSls
Manual SLS

Dlubal.RFEM5.DesignSituationType.UlsEquPermanentTransient
ULS (EQU) - Permanent / transient

Dlubal.RFEM5.DesignSituationType.UlsEquAccidental
ULS (EQU) - Accidental

Dlubal.RFEM5.DesignSituationType.UlsEquAccidentalPsi11
ULS (EQU) - Accidental - psi-1,1

Dlubal.RFEM5.DesignSituationType.UlsEquAccidentalPsi21
ULS (EQU) - Accidental - psi-2,1

Dlubal.RFEM5.DesignSituationType.UlsEquAccidentalSnowPsi11
ULS (EQU) - Accidental - Snow - psi-1,1

Dlubal.RFEM5.DesignSituationType.UlsEquAccidentalSnowPsi21
ULS (EQU) - Accidental - Snow - psi-2,1

Dlubal.RFEM5.DesignSituationType.UlsEquSeismic
ULS (EQU) - Seismic

Dlubal.RFEM5.DesignSituationType.UlsStaticEquilibriumFundamental
ULS Static Equilibrium - Fundamental

Dlubal.RFEM5.DesignSituationType.UlsStaticEquilibriumAccidental
ULS Static Equilibrium - Accidental

Dlubal.RFEM5.DesignSituationType.UlsType1Fundamental
ULS Type 1 - Fundamental

Dlubal.RFEM5.DesignSituationType.UlsType1AccidentalPsi11
ULS Type 1 - Accidental - psi-1,1

Dlubal.RFEM5.DesignSituationType.UlsType1AccidentalPsi21
ULS Type 1 - Accidental - psi-2,1

Dlubal.RFEM5.DesignSituationType.UlsStrPermanentTransient610
ULS (STR/GEO) - Permanent / transient - Eq. 6.10

Dlubal.RFEM5.DesignSituationType.UlsStrPermanentTransient610AAndB
ULS (STR/GEO) - Permanent / transient - Eq. 6.10a and 6.10b

Dlubal.RFEM5.DesignSituationType.UlsStrPermanentTransient610AModB
ULS (STR/GEO) - Permanent / transient - Eq. 6.10a-mod and 6.10b

Dlubal.RFEM5.DesignSituationType.UlsStrAccidental
ULS (STR/GEO) - Accidental

Dlubal.RFEM5.DesignSituationType.UlsStrAccidentalPsi11
ULS (STR/GEO) - Accidental - psi-1.1

Dlubal.RFEM5.DesignSituationType.UlsStrAccidentalPsi21
ULS (STR/GEO) - Accidental - psi-2.1

Dlubal.RFEM5.DesignSituationType.UlsStrAccidentalShowPsi11
ULS (STR/GEO) - Accidental - Show - psi-1.1

Dlubal.RFEM5.DesignSituationType.UlsStrAccidentalShowPsi21
ULS (STR/GEO) - Accidental - Show - psi-2.1

Dlubal.RFEM5.DesignSituationType.UlsStrSeismic
ULS (STR/GEO) - Seismic

Dlubal.RFEM5.DesignSituationType.UlsFailureStructureFundamental
ULS Failure of Structure - Fundamental

Dlubal.RFEM5.DesignSituationType.UlsFailureStructureAccidental
ULS Failure of Structure - Accidental

Dlubal.RFEM5.DesignSituationType.UlsType2Fundamental
ULS Type 2 - Fundamental

Dlubal.RFEM5.DesignSituationType.UlsType2AccidentalPsi11
ULS Type 2 - Accidental - psi-1,1

Dlubal.RFEM5.DesignSituationType.UlsType2AccidentalPsi21
ULS Type 2 - Accidental - psi-2,1

Dlubal.RFEM5.DesignSituationType.UlsType3Fundamental
ULS Type 3 - Fundamental

Dlubal.RFEM5.DesignSituationType.UlsType3AccidentalPsi11
ULS Type 3 - Accidental - psi-1,1

Dlubal.RFEM5.DesignSituationType.UlsType3AccidentalPsi21
ULS Type 3 - Accidental - psi-2,1

Dlubal.RFEM5.DesignSituationType.ChinaUlsStaticEquilibriumFundamental
China ULS Static Equilibrium - Fundamental

Dlubal.RFEM5.DesignSituationType.ChinaUlsStaticEquilibriumAccidental
China ULS Static Equilibrium - Accidental

Dlubal.RFEM5.DesignSituationType.ChinaUlsStaticEquilibriumSeismic
China ULS Static Equilibrium - Seismic

Dlubal.RFEM5.DesignSituationType.ChinaUlsFailureOfStructureFundamental
China ULS Failure of Structure - Fundamental

Dlubal.RFEM5.DesignSituationType.ChinaUlsFailureOfStructureAccidental
China ULS Failure of Structure - Accidental

Dlubal.RFEM5.DesignSituationType.ChinaUlsFailureOfStructureSeismic
China ULS Failure of Structure - Seismic

Dlubal.RFEM5.DesignSituationType.UlsGeoPermanentTransient
ULS (GEO) - Permanent / transient

Dlubal.RFEM5.DesignSituationType.UlsGeoAccidentalPsi11
ULS (GEO) - Accidental - psi - 1,1

Dlubal.RFEM5.DesignSituationType.UlsGeoAccidentalPsi21
ULS (GEO) - Accidental - psi - 2,1

Dlubal.RFEM5.DesignSituationType.UlsGeoSeismic
ULS (GEO) - Seismic

Dlubal.RFEM5.DesignSituationType.SlsCharacteristic
SLS - Characteristic

Dlubal.RFEM5.DesignSituationType.SlsFrequent
SLS - Frequent

Dlubal.RFEM5.DesignSituationType.SlsQuasiPermanent
SLS - Quasi-permanent

Dlubal.RFEM5.DesignSituationType.SlsServiceability
SLS - Serviceability

Dlubal.RFEM5.DesignSituationType.SlsCharacteristic1
SLS - Characteristic 1

Dlubal.RFEM5.DesignSituationType.SlsCharacteristic2
SLS - Characteristic 1

Dlubal.RFEM5.DesignSituationType.SlsEarthquake
SLS - Earthquake

Dlubal.RFEM5.DesignSituationType.SlsVibration
SLS - Vibration

Dlubal.RFEM5.DesignSituationType.SlsNonFrequent
SLS - Non-frequent

Dlubal.RFEM5.DesignSituationType.SlsCharacteristicQuasiPermanent
SLS - Characteristic / Quasi-Permanent

Dlubal.RFEM5.DesignSituationType.Section23
Section 2.3 (LRFD)

Dlubal.RFEM5.DesignSituationType.Section231
Section 2.3 (LRFD), 1.

Dlubal.RFEM5.DesignSituationType.Section232
Section 2.3 (LRFD), 2.

Dlubal.RFEM5.DesignSituationType.Section233
Section 2.3 (LRFD), 3.

Dlubal.RFEM5.DesignSituationType.Section234
Section 2.3 (LRFD), 4.

Dlubal.RFEM5.DesignSituationType.Section235
Section 2.3 (LRFD), 5.

Dlubal.RFEM5.DesignSituationType.Section236
Section 2.3 (LRFD), 6.

Dlubal.RFEM5.DesignSituationType.Section237
Section 2.3 (LRFD), 7.

Dlubal.RFEM5.DesignSituationType.Section24
Section 2.4 (ASD)

Dlubal.RFEM5.DesignSituationType.Section241
Section 2.4 (ASD), 1.

Dlubal.RFEM5.DesignSituationType.Section242
Section 2.4 (ASD), 2.

Dlubal.RFEM5.DesignSituationType.Section243
Section 2.4 (ASD), 3.

Dlubal.RFEM5.DesignSituationType.Section244
Section 2.4 (ASD), 4.

Dlubal.RFEM5.DesignSituationType.Section245
Section 2.4 (ASD), 5.

Dlubal.RFEM5.DesignSituationType.Section246
Section 2.4 (ASD), 6.

Dlubal.RFEM5.DesignSituationType.Section247
Section 2.4 (ASD), 7.

Dlubal.RFEM5.DesignSituationType.Section248
Section 2.4 (ASD), 8.

Dlubal.RFEM5.DesignSituationType.Asce10Section23
Section 2.3 (LRFD)

Dlubal.RFEM5.DesignSituationType.Asce10Section231
Section 2.3 (LRFD), 1.

Dlubal.RFEM5.DesignSituationType.Asce10Section232
Section 2.3 (LRFD), 2.

Dlubal.RFEM5.DesignSituationType.Asce10Section233
Section 2.3 (LRFD), 3.

Dlubal.RFEM5.DesignSituationType.Asce10Section234
Section 2.3 (LRFD), 4.

Dlubal.RFEM5.DesignSituationType.Asce10Section235
Section 2.3 (LRFD), 5.

Dlubal.RFEM5.DesignSituationType.Asce10Section236
Section 2.3 (LRFD), 6.

Dlubal.RFEM5.DesignSituationType.Asce10Section237
Section 2.3 (LRFD), 7.

Dlubal.RFEM5.DesignSituationType.Asce10Section24
Section 2.4 (ASD)

Dlubal.RFEM5.DesignSituationType.Asce10Section241
Section 2.4 (ASD), 1.

Dlubal.RFEM5.DesignSituationType.Asce10Section242
Section 2.4 (ASD), 2.

Dlubal.RFEM5.DesignSituationType.Asce10Section243
Section 2.4 (ASD), 3.

Dlubal.RFEM5.DesignSituationType.Asce10Section244
Section 2.4 (ASD), 4.

Dlubal.RFEM5.DesignSituationType.Asce10Section245
Section 2.4 (ASD), 5.

Dlubal.RFEM5.DesignSituationType.Asce10Section246A
Section 2.4 (ASD), 6a

Dlubal.RFEM5.DesignSituationType.Asce10Section246B
Section 2.4 (ASD), 6b

Dlubal.RFEM5.DesignSituationType.Asce10Section247
Section 2.4 (ASD), 7.

Dlubal.RFEM5.DesignSituationType.Asce10Section248
Section 2.4 (ASD), 8.

Dlubal.RFEM5.DesignSituationType.Asce10Section25
Section 2.5 (Extraordinary)

Dlubal.RFEM5.DesignSituationType.Asce10Section251
Section 2.5 (Extraordinary), 1.

Dlubal.RFEM5.DesignSituationType.Asce10Section252
Section 2.5 (Extraordinary), 2.

Dlubal.RFEM5.DesignSituationType.Clause722
Clause 7.2.2 (without Earthquake)

Dlubal.RFEM5.DesignSituationType.Clause726A
Clause 7.2.6 (with Earthquake), (a)

Dlubal.RFEM5.DesignSituationType.Clause726B
Clause 7.2.6 (with Earthquake), (b)

Dlubal.RFEM5.DesignSituationType.Clause726C
Clause 7.2.6 (with Earthquake), (c)

Dlubal.RFEM5.DesignSituationType.Chapter9
Chapter 9, Strength and Serviceability Requirements

Dlubal.RFEM5.DesignSituationType.Chapter91
Chapter 9, Strength and Serviceability Requirements (9-1)

Dlubal.RFEM5.DesignSituationType.Chapter92
Chapter 9, Strength and Serviceability Requirements (9-2)

Dlubal.RFEM5.DesignSituationType.Chapter93
Chapter 9, Strength and Serviceability Requirements (9-3)

Dlubal.RFEM5.DesignSituationType.Chapter94
Chapter 9, Strength and Serviceability Requirements (9-4)

Dlubal.RFEM5.DesignSituationType.Chapter95
Chapter 9, Strength and Serviceability Requirements (9-5)

Dlubal.RFEM5.DesignSituationType.Chapter96
Chapter 9, Strength and Serviceability Requirements (9-6)

Dlubal.RFEM5.DesignSituationType.Chapter97
Chapter 9, Strength and Serviceability Requirements (9-7)

Dlubal.RFEM5.DesignSituationType.AppecndixC
Appendix C, Alternative Load and Strength Reduction Factors

Dlubal.RFEM5.DesignSituationType.AppecndixC91
Appendix C, Alternative Load and Strength Reduction Factors (C.9-1)

Dlubal.RFEM5.DesignSituationType.AppecndixC92
Appendix C, Alternative Load and Strength Reduction Factors (C.9-2)

Dlubal.RFEM5.DesignSituationType.AppecndixC93
Appendix C, Alternative Load and Strength Reduction Factors (C.9-3)

Dlubal.RFEM5.DesignSituationType.AppecndixC94
Appendix C, Alternative Load and Strength Reduction Factors (C.9-4)

Dlubal.RFEM5.DesignSituationType.AppecndixC95
Appendix C, Alternative Load and Strength Reduction Factors (C.9-5)

Dlubal.RFEM5.DesignSituationType.AppecndixC96
Appendix C, Alternative Load and Strength Reduction Factors (C.9-6)

Dlubal.RFEM5.DesignSituationType.Chapter5
Chapter 5 - Loads

Dlubal.RFEM5.DesignSituationType.Chapter531A
Chapter 5 - Loads, (5.3.1a)

Dlubal.RFEM5.DesignSituationType.Chapter531B
Chapter 5 - Loads, (5.3.1b)

Dlubal.RFEM5.DesignSituationType.Chapter531C
Chapter 5 - Loads, (5.3.1c)

Dlubal.RFEM5.DesignSituationType.Chapter531D
Chapter 5 - Loads, (5.3.1d)

Dlubal.RFEM5.DesignSituationType.Chapter531E
Chapter 5 - Loads, (5.3.1e)

Dlubal.RFEM5.DesignSituationType.Chapter531F
Chapter 5 - Loads, (5.3.1f)

Dlubal.RFEM5.DesignSituationType.Chapter531G
Chapter 5 - Loads, (5.3.1g)

Dlubal.RFEM5.DesignSituationType.LimitStateOfStrength
Limit State of Strength

Dlubal.RFEM5.DesignSituationType.LimitStateOfStrength1
Limit State of Strength - DL+LL+CL

Dlubal.RFEM5.DesignSituationType.LimitStateOfStrength2
Limit State of Strength - DL+LL+CL+WL/EL (0.6WL/0.6EL)

Dlubal.RFEM5.DesignSituationType.LimitStateOfStrength3
Limit State of Strength - DL+LL+CL+WL/EL (1.2WL/1.2EL)

Dlubal.RFEM5.DesignSituationType.LimitStateOfStrength4
Limit State of Strength - DL+WL/EL

Dlubal.RFEM5.DesignSituationType.LimitStateOfStrength5
Limit State of Strength - DL+ER

Dlubal.RFEM5.DesignSituationType.LimitStateOfStrength6
Limit State of Strength - DL+LL+AL

Dlubal.RFEM5.DesignSituationType.LimitStateOfServiceability
Limit State of Serviceability

Dlubal.RFEM5.DesignSituationType.LimitStateOfServiceability1
Limit State of Serviceability - DL+LL+CL

Dlubal.RFEM5.DesignSituationType.LimitStateOfServiceability2
Limit State of Serviceability - DL+LL+CL+WL/EL

Dlubal.RFEM5.DesignSituationType.LimitStateOfServiceability3
Limit State of Serviceability - DL+WL/EL

Dlubal.RFEM5.DesignSituationType.StrengthAndStabilityLimitStates
Strength and Stability Limit States

Dlubal.RFEM5.DesignSituationType.StrengthAndStabilityLimitStates1
Strength and Stability Limit States 1

Dlubal.RFEM5.DesignSituationType.StrengthAndStabilityLimitStates2
Strength and Stability Limit States 2

Dlubal.RFEM5.DesignSituationType.StrengthAndStabilityLimitStates3
Strength and Stability Limit States 3

Dlubal.RFEM5.DesignSituationType.StrengthAndStabilityLimitStates4
Strength and Stability Limit States 4

Dlubal.RFEM5.DesignSituationType.ServiceabilityLimitState
Serviceability Limit State

Dlubal.RFEM5.DesignSituationType.ServiceabilityLimitState1
Serviceability Limit State 1

Dlubal.RFEM5.DesignSituationType.ServiceabilityLimitState2
Serviceability Limit State 2

Dlubal.RFEM5.DesignSituationType.ServiceabilityLimitState3
Serviceability Limit State 3

Dlubal.RFEM5.DesignSituationType.NbccLimitStateOfStrength
Limit State of Strength

Dlubal.RFEM5.DesignSituationType.NbccLimitStateOfStrength1
Limit State of Strength, (1)

Dlubal.RFEM5.DesignSituationType.NbccLimitStateOfStrength2
Limit State of Strength, (2)

Dlubal.RFEM5.DesignSituationType.NbccLimitStateOfStrength3
Limit State of Strength, (3)

Dlubal.RFEM5.DesignSituationType.NbccLimitStateOfStrength4
Limit State of Strength, (4)

Dlubal.RFEM5.DesignSituationType.NbccLimitStateOfStrength5
Limit State of Strength, (5)

Dlubal.RFEM5.DesignSituationType.NbccLimitStateOfServiceability
Limit State of Serviceability

Dlubal.RFEM5.DesignSituationType.PipingOperating
Operating

Dlubal.RFEM5.DesignSituationType.PipingSustained
Sustained

Dlubal.RFEM5.DesignSituationType.PipingExpansion
Expansion

Dlubal.RFEM5.DesignSituationType.PipingOccasional
Occasional

Dlubal.RFEM5.DesignSituationType.PipingHangerSituation
Hanger

Dlubal.RFEM5.DesignSituationType.PipingHydroPressureTest
Hydro Pressure Test

Dlubal.RFEM5.DesignSituationType.NbrUlsNormal
ULS - Normal

Dlubal.RFEM5.DesignSituationType.NbrUlsSpecial
ULS - Special

Dlubal.RFEM5.DesignSituationType.NbrUlsExceptional
ULS - Exceptional

Dlubal.RFEM5.DesignSituationType.NbrSlsRare
SLS - Rare

Dlubal.RFEM5.DesignSituationType.UlsFatigue
ULS(FAT) - Fatigue